"""
===================================================================================================
Script which contains dictionaries with necessary themes for each grade for subject: mathematics.
===================================================================================================
"""


# 9th grade dictionary.
math_themes_9_level = {
    'Числа и вычисления': 'Числа и вычисления',
    'Числовые неравенства, координатная прямая': 'Числовые неравенства, координатная прямая',
    'Числа, вычисления и алгебраические выражения': 'Числа, вычисления и алгебраические выражения',
    'Уравнения, системы уравнений': 'Уравнения, системы уравнений',
    'Статистика, вероятности': 'Статистика, вероятности',
    'Расчеты по формулам': 'Расчеты по формулам',
    'Неравенства, системы неравенств': 'Неравенства, системы неравенств',
    'Задачи на прогрессии': 'Задачи на прогрессии',
    'Треугольники, четырёхугольники, многоугольники и их элементы': 'Треугольники, четырёхугольники, многоугольники и их элементы',
    'Окружность, круг и их элементы': 'Окружность, круг и их элементы',
    'Площади фигур': 'Площади фигур',
    'Анализ геометрических высказываний': 'Анализ геометрических высказываний',
    'Текстовые задачи': 'Текстовые задачи',
    'Задачи с прикладным содержанием': 'Задачи с прикладным содержанием'
}

# 10th grade dictionary.
math_themes_10_level = {
    'Числа и вычисления': 'Числа и вычисления',
    'Числовые неравенства, координатная прямая': 'Числовые неравенства, координатная прямая',
    'Числа, вычисления и алгебраические выражения': 'Числа, вычисления и алгебраические выражения',
    'Уравнения, системы уравнений': 'Уравнения, системы уравнений',
    'Статистика, вероятности': 'Статистика, вероятности',
    'Расчеты по формулам': 'Расчеты по формулам',
    'Неравенства, системы неравенств': 'Неравенства, системы неравенств',
    'Задачи на прогрессии': 'Задачи на прогрессии',
    'Треугольники, четырёхугольники, многоугольники и их элементы': 'Треугольники, четырёхугольники, многоугольники и их элементы',
    'Окружность, круг и их элементы': 'Окружность, круг и их элементы',
    'Площади фигур': 'Площади фигур',
    'Анализ геометрических высказываний': 'Анализ геометрических высказываний',
    'Наибольшее и наименьшее значение функций': 'Наибольшее и наименьшее значение функций',
    'Стереометрия': 'Стереометрия',
    'Вероятности сложных событий': 'Вероятности сложных событий',
    'Задачи с прикладным содержанием': 'Задачи с прикладным содержанием'
}

# 11th grade dictionary.
math_themes_11_level = {
    'Числа и вычисления': 'Числа и вычисления',
    'Числовые неравенства, координатная прямая': 'Числовые неравенства, координатная прямая',
    'Числа, вычисления и алгебраические выражения': 'Числа, вычисления и алгебраические выражения',
    'Уравнения, системы уравнений': 'Уравнения, системы уравнений',
    'Статистика, вероятности': 'Статистика, вероятности',
    'Расчеты по формулам': 'Расчеты по формулам',
    'Неравенства, системы неравенств': 'Неравенства, системы неравенств',
    'Задачи на прогрессии': 'Задачи на прогрессии',
    'Треугольники, четырёхугольники, многоугольники и их элементы': 'Треугольники, четырёхугольники, многоугольники и их элементы',
    'Окружность, круг и их элементы': 'Окружность, круг и их элементы',
    'Площади фигур': 'Площади фигур',
    'Анализ геометрических высказываний': 'Анализ геометрических высказываний',
    'Текстовые задачи': 'Текстовые задачи',
    'Наибольшее и наименьшее значение функций': 'Наибольшее и наименьшее значение функций',
    'Финансовая математика': 'Финансовая математика',
    'Стереометрия': 'Стереометрия',
    'Вероятности сложных событий': 'Вероятности сложных событий',
    'Задачи с прикладным содержанием': 'Задачи с прикладным содержанием'
}
