"""
======================================================================================================
Script which contains dictionaries with necessary themes for each grade for subject: russian language.
======================================================================================================
"""


# 9th grade dictionary.
rus_themes_9_level = {
      "Постановка ударения": "Постановка ударения",
      "Лексические нормы": "Лексические нормы",
      "Морфологические нормы (образование форм слова)": "Морфологические нормы (образование форм слова)",
      "Синтаксические нормы": "Синтаксические нормы",
      "Правописание корней": "Правописание корней",
      "Правописание приставок": "Правописание приставок и суффиксов",
      "Правописание НЕ и НИ": "Правописание НЕ и НИ",
      "Слитное, дефисное, раздельное написание слов": "Слитное, дефисное, раздельное написание слов",
      "Правописание -Н- и -НН- в суффиксах": "Правописание -Н- и -НН- в суффиксах",
      "Пунктуация в сложносочиненном предложении и в предложении с однородными членами": "Пунктуация в сложносочиненном предложении и в предложении с однородными членами",
      "Знаки препинания в предложениях с обособленными членами": "Знаки препинания в предложениях с обособленными членами",
      "Знаки препинания при словах и конструкциях, не связанных с членами предложения": "Знаки препинания при словах и конструкциях, не связанных с членами предложения",
      "Грамматическая основа предложения": "Грамматическая основа предложения",
      "Знаки препинания в бессоюзном сложном предложении": "Знаки препинания в бессоюзном сложном предложении",
      "Простое осложненное предложение": "Работа с текстом"
}

# 10th grade dictionary.
rus_themes_10_level = {
      "Постановка ударения": "Постановка ударения",
      "Лексические нормы": "Лексические нормы",
      "Морфологические нормы (образование форм слова)": "Морфологические нормы (образование форм слова)",
      "Синтаксические нормы": "Синтаксические нормы",
      "Правописание корней": "Правописание корней",
      "Правописание приставок": "Правописание приставок и суффиксов",
      "Правописание НЕ и НИ": "Правописание НЕ и НИ",
      "Слитное, дефисное, раздельное написание слов": "Слитное, дефисное, раздельное написание слов",
      "Правописание -Н- и -НН- в суффиксах": "Правописание -Н- и -НН- в суффиксах",
      "Пунктуация в сложносочиненном предложении и в предложении с однородными членами": "Пунктуация в сложносочиненном предложении и в предложении с однородными членами",
      "Знаки препинания в предложениях с обособленными членами": "Знаки препинания в предложениях с обособленными членами",
      "Знаки препинания при словах и конструкциях, не связанных с членами предложения": "Знаки препинания при словах и конструкциях, не связанных с членами предложения",
      "Знаки препинания в сложноподчиненном предложении": "Знаки препинания в сложноподчиненном предложении",
      "Грамматическая основа предложения": "Грамматическая основа предложения",
      "Знаки препинания в бессоюзном сложном предложении": "Знаки препинания в бессоюзном сложном предложении",
      "Простое осложненное предложение": "Работа с текстом"
}

# 11th grade dictionary.
rus_themes_11_level = {
      "Постановка ударения": "Постановка ударения",
      "Употребление паронимов": "Употребление паронимов",
      "Лексические нормы": "Лексические нормы",
      "Морфологические нормы (образование форм слова)": "Морфологические нормы (образование форм слова)",
      "Синтаксические нормы": "Синтаксические нормы",
      "Правописание корней": "Правописание корней",
      "Правописание приставок": "Правописание приставок и суффиксов",
      "Правописание НЕ и НИ": "Правописание НЕ и НИ",
      "Слитное, дефисное, раздельное написание слов": "Слитное, дефисное, раздельное написание слов",
      "Правописание -Н- и -НН- в суффиксах": "Правописание -Н- и -НН- в суффиксах",
      "Пунктуация в сложносочиненном предложении и в предложении с однородными членами": "Пунктуация в сложносочиненном предложении и в предложении с однородными членами",
      "Знаки препинания в предложениях с обособленными членами": "Знаки препинания в предложениях с обособленными членами",
      "Знаки препинания при словах и конструкциях, не связанных с членами предложения": "Знаки препинания при словах и конструкциях, не связанных с членами предложения",
      "Знаки препинания в сложноподчиненном предложении": "Знаки препинания в сложноподчиненном предложении",
      "Знаки препинания в сложных предложениях с разными видами связи": "Знаки препинания в сложных предложениях с разными видами связи",
      "Грамматическая основа предложения": "Грамматическая основа предложения",
      "Знаки препинания в бессоюзном сложном предложении": "Знаки препинания в бессоюзном сложном предложении",
      "Простое осложненное предложение": "Работа с текстом"
    }
